Revit 2024 API
ExporterIFCUtils.GetRoomBoundaryAsCurveLoopArray Method
 Obtains the spatial element boundary curves as an array of CurveLoops, needed for processing into IFC-specific elements later.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static IList<CurveLoop> GetRoomBoundaryAsCurveLoopArray(
	SpatialElement spatialElement,
	SpatialElementBoundaryOptions options,
	bool cleanCurves
)
Visual Basic
Public Shared Function GetRoomBoundaryAsCurveLoopArray ( _
	spatialElement As SpatialElement, _
	options As SpatialElementBoundaryOptions, _
	cleanCurves As Boolean _
) As IList(Of CurveLoop)
Visual C++
public:
static IList<CurveLoop^>^ GetRoomBoundaryAsCurveLoopArray(
	SpatialElement^ spatialElement,
	SpatialElementBoundaryOptions^ options,
	bool cleanCurves
)
Parameters
spatialElement
Type: Autodesk.Revit.DB.SpatialElement
 The spatial element.
options
Type: Autodesk.Revit.DB.SpatialElementBoundaryOptions
 The options for extraction of the boundaries.
cleanCurves
Type: System.Boolean
 If true, curves will be trimmed to meet their neighbors. If false, no trimming will take place.
Return Value
 The list of CurveLoops, which could be empty if the routine is unable to get the boundary curve loops.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Throws an exception if any of the boundary loops are invalid or degenerate.
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace